[UICovertActions]
CovertActions_WarningAmbush=WARNING!\nThis mission is susceptible to ambush. We should make sure our soldiers are properly equipped for combat.

[MissionTimers]
DataRetrievalTitle="Evacuate"
DataRetrievalSubtitle="Turns until enemy reinforcements start arriving"

DatamineTitle="Datamining"
DatamineSubtitle="Turns until datamining complete"

DatamineRetTitle="Container Detonation"
DatamineRetSubtitle="Turns until destroyed"

[Reward_RaiderBaseAction X2RewardTemplate]
DisplayName="Destroy Raider Base"
RewardDetails="Raid the raider faction base on this continent, preventing them from frequently appearing on missions here."

[Reward_DiscoverRaiderBase X2RewardTemplate]
DisplayName="Locate Raider Base"
RewardDetails="Find the raider faction base on this continent, as a prelude to destroying their base of operations."

[CovertActionNarrative_FindRaiderBase X2CovertActionNarrativeTemplate]
ActionName="Finding Raiders"
ActionPreNarrative="Intelligence indicates there's a raider base in <XGParam:StrValue3/!ContinentName/>. They'll be a constant problem with missions in the continent, a problem we may be able to resolve if we can find the exact coordinates of their base."
ActionPostNarrative="We've found out where their HQ is: now we just need to time to plan in a destruction operation for it."

[CovertActionNarrative_RaiderDataRetrieval X2CovertActionNarrativeTemplate]
ActionName="Covert Operation: Data Retrieval"
ActionPreNarrative="We have reason to believe that raiders operating in <XGParam:StrValue3/!ContinentName/> have recently stolen major ADVENT intel: if we send in an operative on a covert op, we can try snagging that intel for ourselves."
ActionPostNarrative="The operation was a success: now we have a much wider look at how ADVENT has been operating recently."

[CovertActionNarrative_RaiderBaseAction X2CovertActionNarrativeTemplate]
ActionName="Wrecking Raiders"
ActionPreNarrative="The Raiders in <XGParam:StrValue3/!ContinentName/> have had a well defended base, but we now have the opportunity to strike a fatal blow against their headquarters. This may be our one shot at hindering their efforts once and for all."
ActionPostNarrative="They'll still have personnel out there in the world, but they should be much less of a problem now."


; rewards

[CovertAction_FindRaiderBase X2CovertActionTemplate]
ActionObjective="Locate Raider HQ"

[CovertAction_RaiderBaseAction X2CovertActionTemplate]
ActionObjective="Destroy Raider HQ"

[CovertAction_RaiderDataRetrieval X2CovertActionTemplate]
ActionObjective="Covert Op: Data Retrieval"


[CovertActionRisk_RaiderAmbush X2CovertActionRiskTemplate]
RiskName="Raider Ambush"

[RaiderAmbush_Recap X2MissionFlavorTextTemplate]
FlavorText="MISSING FLAVOR TEXT"
CouncilSpokesmanSuccessText="While these unknown hostiles wished to interfere with XCOM's mission Commander, your quick work has ensured the continuing success of the Resistance."
CouncilSpokesmanFailureText="It would seem these hostiles was well-prepared in this operation, Commander. We will have to ensure that your soldiers' sacrifice was not in vain."

[RaiderBaseTakedown_Recap X2MissionFlavorTextTemplate]
CouncilSpokesmanSuccessText="With the destruction of their main base of operations, XCOM's operations in their regions can better focus on ADVENT and their alien masters."
CouncilSpokesmanFailureText="This setback was unfortunate, Commander. It may take a great deal of time before we get another chance to strike at these hostiles."

[MissionSource_RaiderAmbush X2MissionSourceTemplate]
MissionPinLabel="Raider Ambush"
MissionExpiredText="We can't afford to leave our people behind, Commander."

; missions

[RM_CovertOp_DataRetrieval X2MissionTemplate]
DisplayName="Recover Intel from Raiders"
Briefing="Recover Intel - Raiders"
PostMissionType="Recover Intel"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Escape with covert operative and XCOM squad"
ObjectiveTextPools[1]="Recover <XGParam:StrValue0/!QuestItemName/> from raider haven"
PreMissionNarratives[0]="X2NarrativeMoments.TACTICAL.Recover.Central_Guerilla_Ops_Recover_Item_Vehicle_04"

[RM_CovertOp_BaseTakedown X2MissionTemplate]
DisplayName="Destroy Primary Raider Base"
Briefing="Destroy Base - Raiders"
PostMissionType="Destroy Base"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Eliminate all hostiles in the AO"


[RM_CovertOp_Datamine X2MissionTemplate]
DisplayName="Recover Materiel from Raiders"
Briefing="Recover Materiel - Raiders"
PostMissionType="Recover Materiel"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Secure datatap"
ObjectiveTextPools[1]="Recover materiel from raider outpost"


[RM_RaiderDatamine X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Protect datatap until completion"
ObjectiveTextPools[1]="Eliminate all hostiles"
ObjectiveTextPools[2]="Recover materiel from container"
ObjectiveTextPools[3]="Extract all surviving XCOM soldiers"

[RM_DataRetrieval X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Keep your squad alive"
ObjectiveTextPools[1]="Recover %QUESTITEM%"
ObjectiveTextPools[2]="Extract %QUESTITEM%"
ObjectiveTextPools[3]="Extract all surviving XCOM soldiers"

[RM_RaiderBaseTakedown X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Eliminate all hostiles in the AO"
ObjectiveTextPools[1]="Extract all surviving XCOM soldiers"

; abilities and sitreps
[RM_CovertPhantom X2AbilityTemplate]
LocFriendlyName="Covert Phantom"
LocLongDescription="This covert operative is concealed, and is impossible to detect for the first two turns of a mission."
LocHelpText="This covert operative is concealed, and is impossible to detect for the first two turns of a mission."
LocFlyOverText="Covert Phantom"

[RM_CovertPhantom X2SitRepTemplate]
FriendlyName="Covert Phantom"
Description="The covert operative will retain concealment on this mission."

[RM_CovertPhantomEffect X2SitRepEffect_GrantAbilities]
FriendlyName="Covert Phantom"
Description="The covert operative will retain concealment on this mission."

[Hack_CovertObjectiveChest X2AbilityTemplate]
LocFriendlyName="Hack Chest"
LocHelpText="Hacks the objective chest."

;items
[RM_RaiderMateriel X2ItemTemplate]
FriendlyName="Raider Materiel"
FriendlyNamePlural="Raider Materiel"
BriefSummary="The crate we recovered ended up leading us to a cache of materiel a raider faction had built up from their recent operations, now in XCOM's hands."
